create table default_quality_indicator (
    quality_indicator_name varchar(200) primary key,
    quality_indicator_id varchar(50) not null,
    canonical_name varchar(200) not null,
    active boolean not null default true
);

insert into default_quality_indicator
    (quality_indicator_name, quality_indicator_id, canonical_name)
values
    ('유효성진단', 'OBJ_00000084167', '유효성진단'),
    ('금액 도메인', 'OBJ_00000084173', '금액 도메인'),
    ('날짜 도메인', 'OBJ_00000084175', '날짜 도메인'),
    ('코드 도메인', 'OBJ_00000084176', '코드 도메인'),
    ('수량 도메인', 'OBJ_00000084172', '수량 도메인'),
    ('여부 도메인', 'OBJ_00000084171', '여부 도메인'),
    ('율 도메인', 'OBJ_00000084174', '율 도메인'),
    ('번호 도메인', 'OBJ_00000084177', '번호 도메인'),
    ('구분 도메인', 'OBJ_00000084177', '번호 도메인'),
    ('정합성진단', 'OBJ_00000180004', '정합성진단'),
    ('완결성진단', 'OBJ_00000180005', '완결성진단'),
    ('시간순서 일관성', 'OBJ_00000084179', '시간순서 일관성'),
    ('계산식', 'OBJ_00000084181', '계산식'),
    ('선후관계 정확성', 'OBJ_00000084184', '선후관계 정확성'),
    ('참조관계', 'OBJ_00000085074', '참조관계'),
    ('논리관계 일관성', 'OBJ_00000180008', '논리관계 일관성'),
    ('공백, 특수문자', 'OB1_00000103014', '공백, 특수문자'),
    ('글자깨짐', 'OBJ_00000180009', '글자깨짐'),
    ('필수값', 'OBJ_00000180010', '필수값'),
    ('중복데이터', 'OBJ_00000180011', '중복데이터'),
    ('업무규칙', 'OBJ_00000103013', '업무규칙');
